<a href="https://colab.research.google.com/github/ejrtks1020/Bigdata_Analysis_Certification/blob/main/%EB%B9%85%EB%B6%84%EA%B8%B0_%EC%9D%B4%EC%83%81%EC%B9%98_%EC%B0%BE%EA%B8%B0(IQR).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')
submission = pd.read_csv('gender_submission.csv')

In [ ]:
train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [ ]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [ ]:
Q3 = np.percentile(train['Fare'], 75)
Q1 = np.percentile(train['Fare'], 25)
IQR = Q3 - Q1

In [ ]:
min = Q1 - 1.5 * IQR
max = Q3 + 1.5 * IQR

In [ ]:
min, max

(-26.724, 65.6344)

In [ ]:
outlier = train[(train['Fare'] < min) | (train['Fare'] > max) ]

In [ ]:
outlier.head()

    PassengerId  Survived  Pclass  ...      Fare        Cabin  Embarked
1             2         1       1  ...   71.2833          C85         C
27           28         0       1  ...  263.0000  C23 C25 C27         S
31           32         1       1  ...  146.5208          B78         C
34           35         0       1  ...   82.1708          NaN         C
52           53         1       1  ...   76.7292          D33         C

[5 rows x 12 columns]

In [ ]:
len(outlier[outlier['Sex'] == 'female'])

70

In [ ]:
outlier['Sex'].value_counts()

female    70
male      46
Name: Sex, dtype: int64

In [ ]:

df = pd.read_csv('basic1.csv')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      100 non-null    object
 1   age     100 non-null    float64
 2   city    100 non-null    object
 3   f1      69 non-null     float64
 4   f2      100 non-null    int64
 5   f3      5 non-null      object
 6   f4      100 non-null    object
 7   f5      100 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 6.4+ KB

In [ ]:
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [ ]:
df.describe()

              age          f1          f2          f5
count  100.000000   69.000000  100.000000  100.000000
mean    50.963000   66.043478    0.650000   56.734537
std     30.442759   19.453893    0.715979   28.454244
min    -13.500000   12.000000    0.000000    9.796378
25%     26.875000   51.000000    0.000000   29.269869
50%     52.500000   63.000000    1.000000   64.113099
75%     77.000000   78.000000    1.000000   81.025055
max    100.000000  111.000000    2.000000   98.429899

In [ ]:
df_float = df[(df['age'] - np.floor(df['age'])) != 0]

In [ ]:
df_float.head()

      id   age city    f1  f2   f3    f4         f5
6   id07  36.3   서울  60.0   1  NaN  ISFJ   9.796378
8   id09   3.3   서울  35.0   2  NaN  ESFJ  17.252986
21  id22  -6.3   부산  72.0   1  NaN  ENFP  52.667078
28  id29 -13.5   부산  47.0   2  NaN  ENTP  67.886373
46  id47  34.6   대구  75.0   1  NaN  ESTJ  90.496999

In [ ]:
df_float['age_ceil'] = np.ceil(df_float['age'])
df_float['age_floor'] = np.floor(df_float['age'])
df_float['age_trunc'] = np.trunc(df_float['age'])

ceilAvg = df_float['age_ceil'].mean()
floorAvg = df_float['age_floor'].mean()
trucAvg = df_float['age_trunc'].mean()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [ ]:
print(ceilAvg + floorAvg +trucAvg)

69.5